# Pandas Exercises

Time to test your new pandas skills! Use the two csv files in this folder to complete the tasks in bold below!

** NOTE: ALL TASKS MUST BE DONE IN ONE LINE OF PANDAS CODE. GOT STUCK? NO PROBLEM! CHECK OUT THE SOLUTIONS LECTURE! **

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [1]:
import pandas as pd

In [2]:
banks = pd.read_csv('banklist.csv')

** Show the head of the dataframe **

In [3]:
# CODE HERE
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [4]:
banks.shape

(551, 7)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [6]:
# CODE HERE
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [11]:
# CODE HERE
banks['ST'].nunique()

44

44

** Get a list or array of all the states in the data set. **

In [13]:
# CODE HERE
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** What are the top 5 states with the most failed banks? **

In [14]:
# CODE HERE
banks['ST'].value_counts()[0:6]

GA    93
FL    75
IL    67
CA    41
MN    23
WA    19
Name: ST, dtype: int64

In [15]:
banks.groupby("ST").count().sort_values('Bank Name',ascending=False).iloc[:5]['Bank Name']

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** What are the top 5 acquiring institutions? **

In [20]:
# CODE HERE
banks['Acquiring Institution'].value_counts().iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [21]:
# CODE HERE
banks[banks['Acquiring Institution'] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [22]:
# CODE HERE
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name',ascending=False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

** How many failed banks don't have the word "Bank" in their name? **

In [30]:
# CODE HERE

names = [name for name in banks['Bank Name'] if 'Bank' not in name]
len(names)

14

In [28]:
sum(banks['Bank Name'].apply(lambda name: 'Bank' not in name))

14

** How many bank names start with the letter 's' ? **

In [32]:
# CODE HERE
sum(banks['Bank Name'].apply(lambda name:name[0].upper() =='S'))

53

53

** How many CERT values are above 20000 ? **

In [34]:
# CODE HERE
sum(banks['CERT'] > 20000)

417

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [38]:
# CODE HERE
sum(banks['Bank Name'].apply(lambda name:len(name.split())==2))

114

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [40]:
# CODE HERE
sum(banks['Closing Date'].apply(lambda date: date[-2:]) == '08')

25

In [41]:
sum(banks['Closing Date'].apply(lambda date: date[-2:]) == '08')
sum(pd.to_datetime(banks['Closing Date']).apply(lambda date: date.year) == 2008)

25

In [50]:
banks['Closing Date'] = pd.to_datetime(banks['Closing Date'])

In [52]:
banks.sort_values(by=['Closing Date'])

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,2000-10-13,17-Mar-05
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,2000-12-14,17-Mar-05
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2001-02-02,18-Feb-03
547,Malta National Bank,Malta,OH,6629,North Valley Bank,2001-05-03,18-Nov-02
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",2001-07-27,19-Aug-14
545,"Hamilton Bank, NA",Miami,FL,24382,Israel Discount Bank of New York,2002-01-11,21-Sep-15
544,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,2002-01-18,6-Nov-03
543,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,2002-02-01,25-Oct-12
542,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,2002-02-07,5-Feb-15
541,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,2002-03-01,9-Apr-08
540,New Century Bank,Shelby Township,MI,34979,No Acquirer,2002-03-28,18-Mar-05
539,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,2002-06-26,14-Feb-12
538,AmTrade International Bank,Atlanta,GA,33784,No Acquirer,2002-09-30,11-Sep-06
537,Bank of Alamo,Alamo,TN,9961,No Acquirer,2002-11-08,18-Mar-05
536,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,2002-12-17,20-Oct-04
535,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,2003-02-07,20-Oct-08
534,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,2003-05-09,5-Jun-12
533,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,2003-11-14,22-Jul-05
532,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,2004-02-14,9-Apr-08
531,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,2004-03-12,5-Jun-12
530,Reliance Bank,White Plains,NY,26778,Union State Bank,2004-03-19,9-Apr-08
529,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,2004-06-25,9-Apr-08
528,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,2007-02-02,27-Oct-10
527,NetBank,Alpharetta,GA,32575,ING DIRECT,2007-09-28,28-Aug-12
526,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,2007-10-04,12-Sep-16
525,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,2008-01-25,26-Oct-12
524,Hume Bank,Hume,MO,1971,Security Bank,2008-03-07,28-Aug-12
523,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,2008-05-09,28-Aug-12
522,"First Integrity Bank, NA",Staples,MN,12736,First International Bank and Trust,2008-05-30,20-Oct-16
521,IndyMac Bank,Pasadena,CA,29730,"OneWest Bank, FSB",2008-07-11,22-Apr-15
...,...,...,...,...,...,...,...
29,Columbia Savings Bank,Cincinnati,OH,32284,"United Fidelity Bank, fsb",2014-05-23,10-Nov-16
28,Slavie Federal Savings Bank,Bel Air,MD,32368,"Bay Bank, FSB",2014-05-30,12-Dec-16
27,Valley Bank,Moline,IL,10450,Great Southern Bank,2014-06-20,26-Jun-15
26,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association",2014-06-20,29-Jun-15
25,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,2014-06-27,25-Mar-16
24,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,2014-07-18,11-Jul-16
23,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC",2014-07-25,12-Dec-16
22,NBRS Financial,Rising Sun,MD,4862,Howard Bank,2014-10-17,26-Mar-15
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,2014-10-24,6-Jan-16
20,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.",2014-11-07,10-Nov-16
19,Northern Star Bank,Mankato,MN,34983,BankVista,2014-12-19,6-Jan-16
18,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,2015-01-16,8-May-17
17,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb",2015-01-23,21-Apr-15
16,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,2015-02-13,21-Apr-15
15,Doral Bank,San Juan,PR,32102,Banco Popular de Puerto Rico,2015-02-27,13-May-15
14,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,2015-05-08,12-Jul-16
13,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb",2015-07-10,17-Aug-16
12,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,2015-10-02,24-Oct-16
11,Hometown National Bank,Longview,WA,35156,Twin City Bank,2015-10-02,13-Apr-16
10,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,2016-03-11,13-Mar-17
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,2016-04-29,6-Sep-16
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,2016-05-06,6-Sep-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,2016-08-19,1-Jun-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,2016-09-23,17-Nov-16
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,2017-01-13,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,2017-01-27,18-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,2017-03-03,18-May-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28,23-May-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,2017-05-05,1-Jun-17
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",2017-05-26,1-Jun-17

In [53]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",2017-05-26,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,2017-05-05,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,2017-04-28,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,2017-03-03,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,2017-01-27,18-May-17

# GREAT JOB!